{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-CITY",
    "2": "I-CITY",
    "3": "B-AREA",
    "4": "I-AREA",
    "5": "B-MINI_AREA",
    "6": "I-MINI_AREA",
    "7": "B-NUM_STREET",
    "8": "I-NUM_STREET",
    "9": "B-MAIN_STREET",
    "10": "I-MAIN_STREET",
    "11": "B-STREET",
    "12": "I-STREET",
    "13": "B-LANDMARK",
    "14": "I-LANDMARK",
    "15": "B-BUILDING",
    "16": "I-BUILDING",
    "17": "B-FLOOR",
    "18": "I-FLOOR",
    "19": "B-APARTMENT",
    "20": "I-APARTMENT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-APARTMENT": 19,
    "B-AREA": 3,
    "B-BUILDING": 15,
    "B-CITY": 1,
    "B-FLOOR": 17,
    "B-LANDMARK": 13,
    "B-MAIN_STREET": 9,
    "B-MINI_AREA": 5,
    "B-NUM_STREET": 7,
    "B-STREET": 11,
    "I-APARTMENT": 20,
    "I-AREA": 4,
    "I-BUILDING": 16,
    "I-CITY": 2,
    "I-FLOOR": 18,
    "I-LANDMARK": 14,
    "I-MAIN_STREET": 10,
    "I-MINI_AREA": 6,
    "I-NUM_STREET": 8,
    "I-STREET": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 64000
}
